src/cf/Enums/ТипыДокументовГИСМТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДокументовГИСМТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПДИсправительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКДИсправительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекККТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПотребление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтатусыДокументовИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДокументовИСМП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проверен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроверен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьОшибки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неопределен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПодтверждениеПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетРегистрациюУчастникаГИСМТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПродолженияПроцессингаДокумента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/СоответствиеТребованиямГИСМТКлиентСервер/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ТипыЭлектронныхДокументовГИСМТ() Экспорт
	ТипДокумента = Новый Массив;
	ТипДокумента.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовГИСМТ.УПД"));
	ТипДокумента.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовГИСМТ.УПДИсправительный"));
	ТипДокумента.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовГИСМТ.УКД"));
	ТипДокумента.Добавить(ПредопределенноеЗначение("Перечисление.ТипыДокументовГИСМТ.УКДИсправительный"));
	Возврат ТипДокумента;
КонецФункции

Функция ДопустимыеЗначенияСтатусаДокументаВСервисе() Экспорт
	СтатусыДокументаВСервисе = Новый Массив;
	СтатусыДокументаВСервисе.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыДокументовИСМП.Проверен"));
	СтатусыДокументаВСервисе.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыДокументовИСМП.Обрабатывается"));
	СтатусыДокументаВСервисе.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыДокументовИСМП.ЕстьОшибки"));
	Возврат СтатусыДокументаВСервисе;
КонецФункции

Функция ЗаголовокКомандыПроверкаОтключена(ПроверкаОтключена) Экспорт
	
	Если ПроверкаОтключена Тогда
		ТекстКомандыОтключитьПроверку = НСтр("ru = 'Включить проверку'");
	Иначе
		ТекстКомандыОтключитьПроверку = НСтр("ru = 'Отключить проверку'");
	КонецЕсли;
	
	Возврат ТекстКомандыОтключитьПроверку;
	
КонецФункции

#КонецОбласти
